app/views/budgets/show.html.erb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."budget_id" = ?  [["budget_id", 1]]
---
    </tr>
    <% @budget.transactions.each do |transaction|%>