app/controllers/budgets_controller.rb

  def index
    @budgets = current_user.budgets
    @years = @budgets.map(&:year).uniq
    @months = @budgets.map(&:month).uniq
---
SELECT "budgets".* FROM "budgets" INNER JOIN "categories" ON "budgets"."category_id" = "categories"."id" WHERE "categories"."user_id" = ?  [["user_id", 1]]
SELECT "budgets".* FROM "budgets" INNER JOIN "categories" ON "budgets"."category_id" = "categories"."id" WHERE "categories"."user_id" = ? AND "budgets"."year" = 2013 AND "budgets"."month" = 8  [["user_id", 1]]

    def set_budget
      @budget = Budget.find(params[:id])
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."id" = ? LIMIT 1  [["id", "1"]]