app/controllers/categories_controller.rb

  def index
    @categories = current_user.categories
    @cashzen_score = 0
    @cashzen_score_denom = 0
    @years = []
    @months = []
    @categories.each do |category|
      @budgets = category.budgets
      @budgets.each do |budget|
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 1]]
SELECT "budgets".* FROM "budgets" WHERE "budgets"."category_id" = ?  [["category_id", 1]]

  def accrued
    @categories = current_user.categories
    @years = []
    @months = []
    @categories.each do |category|
      @budgets = category.budgets
      @budgets.each do |budget|
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 1]]
SELECT "budgets".* FROM "budgets" WHERE "budgets"."category_id" = ?  [["category_id", 1]]

  def show
      @budgets = @category.budgets.order(date: :asc)
      @years = @budgets.map(&:year).uniq
      @months = @budgets.map(&:month).uniq
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."category_id" = ?  [["category_id", 1]]
SELECT "budgets".* FROM "budgets" WHERE "budgets"."category_id" = ? AND "budgets"."year" = 2013 AND "budgets"."month" = 8 ORDER BY "budgets"."id" ASC LIMIT 1  [["category_id", 1]]

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("classification", "created_at", "frequency", "initial_cash", "monthly_spend", "need_type", "net_cash", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "classification" = ?, "need_type" = ?, "frequency" = ?, "updated_at" = ? WHERE "categories"."id" = 2  [["classification", "Variable Expense"], ["need_type", "Want"], ["frequency", "Monthly"], ["updated_at", Thu, 26 Sep 2013 16:19:09 UTC +00:00]]

    def set_category
      @category = current_user.categories.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ? AND "categories"."id" = ? LIMIT 1  [["user_id", 1], ["id", "1"]]