app/controllers/transactions_controller.rb

  def index
    if current_user.transactions.exists?
      @transactions = current_user.transactions.order(date: :asc).paginate(:page => params[:page], :per_page => 30)
---
SELECT "transactions".* FROM "transactions"
SELECT "transactions".* FROM "transactions" ORDER BY "transactions"."date" ASC

  def create
    @transaction = Transaction.new(transaction_params)

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("amount", "budget_id", "category_id", "created_at", "date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @transaction.update(transaction_params)
---
UPDATE "transactions" SET "amount" = ?, "budget_id" = ?, "updated_at" = ? WHERE "transactions"."id" = 7  [["amount", #<BigDecimal:7f77c41df220,'0.2E2',9(18)>], ["budget_id", 1], ["updated_at", Wed, 11 Sep 2013 17:52:29 UTC +00:00]]

  def destroy
    @transaction.destroy
---
DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 1]]

    def set_transaction
      @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT 1  [["id", "1"]]