app/views/categories/_summary_by_classification.html.erb

SELECT "budgets".* FROM "budgets" WHERE "budgets"."category_id" = ? AND "budgets"."month" = 9 AND "budgets"."year" = 2013 ORDER BY "budgets"."id" ASC LIMIT 1  [["category_id", 1]]
---
            <td><%= number_to_currency(category.monthly_spend) %></td>
            <td><%= category.budgets.where(month: Date.today.month, year: Date.today.year).first ? number_to_currency(category.budgets.where(month: Date.today.month, year: Date.today.year).first.remaining) : number_to_currency(category.monthly_spend)  %></td>