app/views/categories/_table_section.html.erb

                <% local_categories.each do |category| %>
                    <td><%= link_to category.budgets.where(year: year, month: month).first.remaining, category.budgets.where(year: year, month: month).first if category.budgets.where(year: year, month: month).first %></td>
---
SELECT "budgets".* FROM "budgets" WHERE "budgets"."category_id" = ? AND "budgets"."year" = 2013 AND "budgets"."month" = 8 ORDER BY "budgets"."id" ASC LIMIT 1  [["category_id", 1]]