app/views/categories/show.html.erb

        <tbody>
        <% @budget.transactions.each do |transaction|%>
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."budget_id" = ?  [["budget_id", 1]]