app/views/categories/show.html.erb

SELECT "transactions".* FROM "transactions" INNER JOIN "budgets" ON "transactions"."budget_id" = "budgets"."id" WHERE "budgets"."category_id" = ?  [["category_id", 1]]
---
  <ul>
    <% @category.transactions.each do |transaction| %>