app/views/transactions/_form.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 1]]
---
    <%= f.label :category %><br>
    <%= f.select :category_id, current_user.categories.map { |category| [category.title, category.id] } %>